{"pageProps":{"lastModified":"Wed, 06 Mar 2024 13:18:45 GMT","data":"# Cream puffs (choux à la crème)\n\n## Ingredients\n\n### Choux dough\n\n* 65g soft flour (or all purpose flour)\n* 65g unslated butter\n* 90ml water\n* 1 pinch of salt\n* 2 eggs (123g weight including shell)\n\n### Custard cream\n\n* 2 egg yolks\n* 2 tbsp cornstarch powder / 2 tbsp flour\n* 20ml milk \n* 3 tbsp sugar\n* 6-7 drops vanilla oil\n\n### Whipped cream \n\n* 150ml whipped cream \n* 2 tbsp sugar\n\n\n## Directions\n\n### Prepare the custard cream\n\n1. In a small bowl, add egg yolks, sugar, the cornstarch (or flour), and the vanilla oil, and mix.\n2. After mixed, add milk, and mix again. \n3. Pour into a pot and bring to boil on low heat. \n4. When lumps start to form, turn off the stove.\n5. Stir well until creamy, and transfer to a bowl and put aside and let cool down in the refrigerator.\n\n### Prepare the choux\n\n1. Preheat your oven to 200°C\n2. In a small bowl, beat the eggs in advance so they are not too cold. \n3. Add the butter to a (preferably stainless steel) pot, along with the water and a pinch of salt.\n4. Bring to boil until the butter is melted.\n5. When the butter is all melted, add the flour to the pot. \n6. Reduce the heat to low and stir quickly, breaking clumps of flour that might form.\n7. After a sort of white film starts to appear on the pan surface, or after 2 minutes, transfer the dough to a bowl.\n8. While still warm, add eggs slowly and mix. (The dough won't mix well if it cools down, so add the eggs when they are relatively warm add them very slowly)\n9. Put the dough into a piping bag or similar device.\n10. On a baking tray lined with parchment paper, squeeze little mountain shaped circles of dough.\n11. Spray the surfaces of the dough with water.\n12. Bake for 20 minutes in the preheated oven. Don't open the oven door during cooking, as the pastries are very temperature sensitive and will collapse if you do. \n13. Turn off the heat, and let cook for another 10 minutes on residual heat. \n14. Take the pastries out and let them cool. \n\n### Preparing the custard whipped cream mix\n\n1. Add whipping cream and sugar to a bowl, and mix until turned into whipped cream.\n2. Add the cooled custard to the whipped cream, and blend together. \n3. Put this filling into a piping bag.\n\n### Finalizing\n\n1. Poke a hole into the cooled down pastries, and fill with the custard cream mix. \n\n\n*Adapted from [delicious day](https://www.youtube.com/watch?v=n-zbtxvPZlw)*\n","pathname":"pastries/cream_puffs"},"__N_SSG":true}